# Курс: AI+Python
# Модуль 2. Комп’ютерний зір
# Тема: масиви. Частина 1
#=======================================================================================
# Завдання 1
# Створіть масив:
# 1 2 3 4
# 5 6 7 8
# 9 10 11 12
# 13 14 15 16
# Використовуючи індекси виведіть:
import numpy as np


nums = np.arange(1,17)
nums = nums.reshape(4, 4)

# ● число 14
print(nums[3, 1])

# ● третій рядок
print(nums[2])

# ● перший стовпчик
print(nums[:, 0])

# ● верхню половину
print(nums[:2])


nums[1:3] = 100
print(nums)

# ● замініть числа в рядках 2-3 на 100
nums[1] = nums[-1]


# ● зробіть другий рядок таким як останній рядок
print(nums)

# #=======================================================================================
# Завдання 2
# У масиві з попереднього завдання створіть маску для парних чисел. З її допомогою
mask = nums > 0

# ● виведіть самі числа
print(nums[mask])

# ● замініть їх на 100
nums[mask] = 100
print(nums[mask])

#=======================================================================================
# Завдання 3
# Створіть 2 масиви типу uint8:
# Масив 1: 128 200 10
# Масив 2: 250 10 34
# Об’єднайте їх у пропорції 20% першого масив + 80% другого масиву.
# В результаті має бути тип даних uint8 та числа в діапазоні 0-255

nums1 = np.array([128, 200, 10], dtype=np.uint8)
nums2 = np.array([250, 10, 34], dtype=np.uint8)

new_nums1 = nums1.astype(np.float32)
new_nums2 = nums2.astype(np.float32)

new_nums1 *= 0.2
new_nums2 *= 0.8

inter_nums = new_nums1 + new_nums2
res_nums = inter_nums.astype(np.uint8)
print(res_nums)