from langchain_google_genai import GoogleGenerativeAI
from langchain.prompts import PromptTemplate

import dotenv
import os

# завантажити api ключі з папки .env
dotenv.load_dotenv()

# отримати сам ключ
api_key = os.getenv('GEMINI_API_KEY')

# створення моделі
# Велика мовна модель(llm)

# llm = GoogleGenerativeAI(
#     model='gemini-2.0-flash',  # назва моделі
#     google_api_key=api_key,  # ваша API
# )

# запит, prompt(підказка)
# prompt engeneering(створення промптів)

# query = "Ти асистент, твоя задача давати відповіді згідно певного документу {rules}"

# створення промпта

# складові промпта
# Хто ти
# базові інструкції(пару речень що треба робити)
# додаткова інформація
# Деталізація(що робити в певних ситуація)
# Приклади
# дані від самого користувача


# prompt = PromptTemplate.from_template(
#     """
#     Ти ввічливий асистент. Твоя задача допомогти людині підготуватись до співбесіди.
#     Ти задаєш питання, користувач відповідає, в кінці співбесіди дай чесний відгук,
#     вкажити що було добре, а де є помилки.
#
#     Використовуй поради з цього документу по проведенню співбесід.
#     Документ: {document}
#
#     ** Якщо користувач починає нервувати коли дає відповіді: **
#         * Якщо користувач починає запинатися, давати нечіткі відповіді,
#         використувавати слова-паразити(наприклад 'Еее', 'Типу', 'Короче')
#         йому потрібно про це вказати та порекомендувати зробити дихальну вправу
#         аби заспокоїтись.
#         * В таких ситуація ти **ПОВИНЕН** змінити тему розмови, трохи знизити
#         емоційне навантаження на користувача, можливо трохи підбадьорити(наприклад
#         сказати що в нього\неї непогано виходить)
#
#     **ПРИКЛАДИ:**
#
#     AI: Чому ви обрали нашу компанію?
#     Користувач: Тому що мені потрібні гроші, а у вас найвища зарплата.
#
#     Помилки користувача: компанії важливо знати що її співробітники справді
#     зацікавленні посадою, модуть запропонувати нові ідеї для комерційних продуктів,
#     Відповідаючи, що вас цікавлять лише гроші створює враження пасивного та меркантильного кандидата,
#     який при першій можливості перейде в іншу компанію
#     Переваги відповіді: переваг немає
#
#     ####
#     Вхідні дані
#
#     Користувач: {user_data}
#     """
# )
#
# document = 'Дуже великий докемнт з порадами'
# user_data = 'Я тут заради грошей'

# так не роблять
# # створення конкретного запити за наведеним шаблоном
# result = prompt.invoke({
#     'document': 'Дуже великий докемнт з порадами',
#     'user_data': 'Я тут заради грошей'
# })
#
# print(result)

# # роблять ось так
#
# # створення ланцюга
# chain = prompt | llm
#
# result = chain.invoke({
#     'document': 'Дуже великий докемнт з порадами',
#     'user_data': 'Я тут заради грошей'
# })
#
# print(result)


# Аналіз тональності
#
# Визнач, чи є тональність тексту позитивною,
# негативною чи нейтральною.

# prompt = PromptTemplate.from_template(
#     """
#     Ти класифікатор текстів. Твоя задача віднести текст до
#     одного з класів: позитивний, негативний, нейтральний.
#     Текст повинен належати лише одному класу, тому давай відповідь одним словом
#     з цих трьох
#
#     **ПРИКЛАДИ:**
#     Текст: мені сподобався цей фільм
#     Клас: позитивний
#
#     Текст: шкода витраченого часу
#     Клас: негативний
#
#     Текст: добре провів час, але вдруге на цей фільм не піду
#     Клас: нейтральний
#
#     Текст: {user_input}
#     Клас:
#     """
# )

# приклади в промптах називають Few-Shot Prompt
# Input:
# Output:

# Human:
# AI:

# Data:
# Result:

# # створення ланцюга
# chain = prompt | llm
#
# user_data = "Обов'язково порекомендую друзям"
#
# response = chain.invoke({
#     'user_input': user_data
# })
# print(response)


# print(12*6 - 2)


# # chain of thought
# data = """У магазині продали 12 коробок. У кожній коробці по 6 пляшок, але в одній коробці не вистачало 2 пляшок.
# Скільки всього пляшок було продано?
#     Дай коротку відповідь одним числом"""
#
# response = llm.invoke(data)
# print(response)


# Термінологія
# Zero-Shot - промпт без прикладів, лише інструкції
# Few-Shot  - промпт з прикладами
# CoT       - chain of thought(ланцюг міркувань). набір кроків щоб розв'язати певну задачу

# Модуль 3. Generative AI, LLM
# Тема: Langchain. Частина 2
# Завдання 1
# ===================================================================================================
# Напишіть промпт для генерації коду функції для вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
# Zero-shot
# Few-shot

# llm = GoogleGenerativeAI(
#     model='gemini-2.5-flash-lite',  # назва моделі
#     api_key=api_key,  # ваша API
# )
#
# # Zero-shot
# prompt = PromptTemplate.from_template(
#     """
#     Ты - программист. Тебе нужно решать разные задачи с помощью этого языка программирования. Ты должен это делать на
#     языке программирования, который тебе напишет пользователь. Код пиши с комментариями.
#     #ЗАДАЧА ОТ ПОЛЬЗОВАТЕЛЯ
#     {user_task}
#     #ЯЗЫК ПРОГРАММИРОВАНИЯ
#     {user_program_language}
#     """
# )
#
# chain = prompt | llm
#
# user_task = input("Опишите задачу: ")
# user_program_language = input("Язык программирования: ")
#
# response = chain.invoke(
#     {
#         "user_task": user_task,
#         "user_program_language": user_program_language
#     }
# )
#
# print(response)
#
# # Few-shot
# prompt = PromptTemplate.from_template(
#     """
#     Ты - программист. Тебе нужно решать разные задачи с помощью этого языка программирования. Ты должен это делать на
#     языке программирования, который тебе напишет пользователь. Код пиши с комментариями.
#     #ПРИМЕРЫ ЗАДАЧ
#     Задача пользователя: Мне нужно посчитать количество вещей в словаре по ключам.
#     Язык программирования: Python
#
#     #ЗАДАЧА ОТ ПОЛЬЗОВАТЕЛЯ
#     {user_task}
#     #ЯЗЫК ПРОГРАММИРОВАНИЯ
#     {user_program_language}
#
#     Ответ пользователю пиши так:
#
#     Задача:
#     Язык:
#     Ответ: здесь твой ответ
#
#     Без формата как я даю тебе инструкции и ненадо заново писать #ЯЗЫК ПРОГРАММИРОВАНИЯ
#     """
# )
#
# chain = prompt | llm
#
# user_task = input("Опишите задачу: ")
# user_program_language = input("Язык программирования: ")
#
# response = chain.invoke(
#     {
#         "user_task": user_task,
#         "user_program_language": user_program_language
#     }
# )
#
# print(response)

# Завдання 2
# ===================================================================================================
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
# Zero-shot
# Few-shot

# Завдання 3
# ===================================================================================================
# Прочитайте файл data\lesson10\products.txt з описом послуг СПА.
# Напишіть промпт для рекомендації послуги виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
# Zero-shot
llm = GoogleGenerativeAI(
    model='gemini-2.5-flash-lite',  # назва моделі
    api_key=api_key,  # ваша API
)

with open("data\lesson10\products.txt", 'r', encoding="utf-8") as file:
    products = file.read()


# Zero-shot -- Few-shot -- Chain of Thoughts
prompt = PromptTemplate.from_template(
    """
    Ты - консультант в СПА салоне. Тебе нужно консультировать посетителей о СПА салоне. 
    Ты должен это делать как знаток СПА сферы и давать точные цены. В СПА салоне есть разные услуги на выбор.
    Рекомендуй услугу в зависимости от бюджета клиента, если клиент неуточнил бюджет или время - 
    порекомендуй услугу на свой вкус и уточни части тела и время услуги.
    #ПРИМЕРЫ ВОПРОСОВ
    1. Болит спина. Бюджет: 2000
    2. Болит шея. Бюджет: 2000
    3. Просто для здоровья. 
    4. Порекомендуйте что-то хорошее
    5. Незнаю сам что хочу

    #ЛОГИЧЕСКИЕ ШАГИ
    1.Ты определяешь из запроса клиента желания по времени, цене, части тела для массажа и его остальные пожелания 
    Распиши себе точно что сказал посетитель. Время: . Бюджет: . Части тела: .
    Если таких подходящих вариантов нет - так и скажи, что к сожелению услуг, подходящих по запросам нет.    
    ПРИМЕР - Длительность меньше 50 минут, цена от 1000 до 1500, части тела
    ПРИМЕР - Длительность любая, цена - любая, части тела по типу шея
    ПРИМЕР - Длительность любая, цена от 500 до 2000, части тела
    2. После обработки первого шага ты подбираешь и рекомендуешь массаж, который подходит по всем его запросам
    3. Дополнительно предлагаешь другие услуги по ценовой категории посетителя
    
    #СПИСОК УСЛУГ
    {products}
    
    #ВОПРОС ОТ ПОСЕТИТЕЛЯ
    {user_question}
    """
)

chain = prompt | llm

user_question = input("Опишите вашу проблему и ваш бюджет: ")

response = chain.invoke(
    {
        "products": products,
        "user_question": user_question,
    }
)

print(response)
